In [1]:
import pandas as pd
import numpy as np

In [2]:
data=pd.read_csv("RawData_Swiggy.csv")

In [3]:
data.shape

(390242, 4)

In [4]:
data.head()

      order_id  customer_id  restaurant_id      date
0  29910774766     17482661           3186  07-01-19
1  29943975418     15329170          14888  07-01-19
2  29949310235      2056776          18532  07-01-19
3  29932792940      6889140           9704  07-01-19
4  29939902210      1949813           5935  07-01-19

In [5]:
len(data["customer_id"].unique())

187793

In [24]:
d=data.groupby(["customer_id","restaurant_id"]).count()

In [26]:
d.head()

                           order_id  date
customer_id restaurant_id
62          18532                 1     1
76          3369                  1     1
92          18532                 1     1
130         3369                  1     1
            18464                 1     1

In [21]:
#data.groupby(["restaurant_id","customer_id"])["customer_id"].count()

In [28]:
f=d.reset_index()

In [29]:
f.head(10)

   customer_id  restaurant_id  order_id  date
0           62          18532         1     1
1           76           3369         1     1
2           92          18532         1     1
3          130           3369         1     1
4          130          18464         1     1
5          163          18532         5     5
6          184          18532         1     1
7          245          18532         1     1
8          262          18464         2     2
9          274           3369         1     1

In [33]:
g=f.groupby("customer_id").count().reset_index()

In [34]:
g.head()

   customer_id  restaurant_id  order_id  date
0           62              1         1     1
1           76              1         1     1
2           92              1         1     1
3          130              2         2     2
4          163              1         1     1

In [39]:
g[g["restaurant_id"]==1]["customer_id"].head(30)

0      62
1      76
2      92
4     163
5     184
6     245
7     262
8     274
9     317
10    331
11    342
12    386
13    396
14    418
15    431
16    439
17    449
18    458
19    462
20    485
21    499
22    521
23    626
24    663
25    667
26    668
27    677
28    682
29    723
30    724
Name: customer_id, dtype: int64